import Mock from "mockjs"
import qs from "querystring"

// 获取首页轮播图信息
Mock.mock("http://10.1.12.30:5000/get_banners", "get", {
    code: 0,
    msg: "用于 E2E 测试",
    data: [
        {
            id: 'a01',
            midImg: 'http://10.1.12.30:5173/static/archcollege/%E4%B8%8A%E6%B5%B7%E6%99%AF%E7%91%9E%E6%82%A6%E6%A8%98%E8%87%BB%E9%80%89(%E4%B8%AD%E5%B1%B1%E5%85%AC%E5%9B%AD%E5%BA%97%EF%BC%89%E6%94%B9%E9%80%A0%E5%AE%9E%E5%BD%95%20_%20%E4%B8%8A%E6%B5%B7%E6%88%90%E6%89%A7%E5%BB%BA%E7%AD%91%E8%AE%BE%E8%AE%A1/1_1581327717260951.jpeg',
            bigMig: 'http://10.1.12.30:5173/static/archcollege/%E4%B8%8A%E6%B5%B7%E6%99%AF%E7%91%9E%E6%82%A6%E6%A8%98%E8%87%BB%E9%80%89(%E4%B8%AD%E5%B1%B1%E5%85%AC%E5%9B%AD%E5%BA%97%EF%BC%89%E6%94%B9%E9%80%A0%E5%AE%9E%E5%BD%95%20_%20%E4%B8%8A%E6%B5%B7%E6%88%90%E6%89%A7%E5%BB%BA%E7%AD%91%E8%AE%BE%E8%AE%A1/1_1581327717260951.jpeg',
            title: '01件使',
            description: '01诗般反映清末民初的文艺映清末民初的文艺映清末民初的文艺映清末民初的文艺映清末民初的文艺作品'
        },
        {
            id: 'a02',
            midImg: 'http://10.1.12.30:5173/static/gooood/No.%2019,%20Melbourne%20By%20Biasol%20-%20%E8%B0%B7%E5%BE%B7%E8%AE%BE%E8%AE%A1%E7%BD%91/12_016-No.-19-By-Biasol.jpeg',
            bigMig: 'http://10.1.12.30:5173/static/gooood/No.%2019,%20Melbourne%20By%20Biasol%20-%20%E8%B0%B7%E5%BE%B7%E8%AE%BE%E8%AE%A1%E7%BD%91/12_016-No.-19-By-Biasol.jpeg',
            title: '02以进',
            description: '02多大家耳熟能详的电视剧本，如《夜宴》《赤壁》《恰同学少年》《血色湘西》《乾隆王朝》《大清御史》《大'
        }, {
            id: 'a03',
            midImg: 'http://10.1.12.30:5173/static/archcollege/%E5%8C%97%E4%BA%AC%E8%A5%BF%E5%8D%95%E6%96%B0%E6%96%87%E5%8C%96%E8%A1%97%E5%90%88%E9%99%A2%E6%94%B9%E9%80%A0%20_%20Super+Partners/1_1560154045414117.jpeg',
            bigMig: 'http://10.1.12.30:5173/static/ArchDaily/6%20Endangered%20World%20Heritage%20Sites%20as%20Seen%20from%20Space/10_DE2_20151016-HATRA.jpeg',
            title: '03对模03对模03对模03对模',
            description: '03近代史专业背景，很长一段时间，三人都在到处搜集有关这段历史的书和资料进行阅读、研'
        }, {
            id: 'a04',
            midImg: 'http://10.1.12.30:5173/static/ArchDaily/Los%20Huertos%20Housing%20_%20Ensalada%20Works%20+%20Architecture%20NRA/56_LosHuertos_Planimetria_VERDE-01.jpeg',
            bigMig: 'http://10.1.12.30:5173/static/ArchDaily/Bellerive%20Resort%20_%20AVA%20Architects/12_bellerive-resort-ava-architects_13.jpeg',
            title: '04型检',
            description: '04的（历史资料）能够找到的都找来了······书摞起来的高度有4米左右。主要的书像梁启超的《李鸿章传》、《剑桥晚清史》，北大的黄德明教授的书我也读了······很多人问我接触过什么学'
        }, {
            id: 'a05',
            midImg: 'http://10.1.12.30:5173/static/archiposition/archiposition/%E9%9D%99%E8%B0%A7%E2%80%9C%E7%BB%BF%E6%B4%B2%E2%80%9D%EF%BC%9ACasa%20TO%E6%B0%91%E5%AE%BF%E9%85%92%E5%BA%97%20_%20Ludwig%20Godefroy%20%E2%80%93%20%E6%9C%89%E6%96%B9/20221018140430youfang76.jpg',
            bigMig: 'http://10.1.12.30:5173/static/gooood/BOSCH%20Szh215%20Parking%20House%20Design%20(Phase%20I)%20by%20ARTS%20Group%20Co.,%20Ltd.%20-%20%E8%B0%B7%E5%BE%B7%E8%AE%BE%E8%AE%A1%E7%BD%91/24_022-bosch-szh215-parking-house-design-phase-i-by-arts-group-co-ltd.jpeg',
            title: '05应的测试反',
            description: '05澜壮阔、跌宕起伏澜壮阔、跌宕起伏澜壮阔、跌宕起伏澜壮阔、跌宕起伏澜壮阔、跌宕起伏澜壮阔、跌宕起伏澜壮阔、跌宕起伏的'
        }
    ],
})

// 获取博客列表
Mock.mock(/^http:\/\/10.1.12.30:5000\/get_blogs(\?.+)?$/, "get", function (options) {
    // 创建一个新的URL对象
    const urlObj = new URL(options.url);
    // 使用URLSearchParams获取查询参数
    const params = new URLSearchParams(urlObj.search);
    // 将查询参数转换为对象
    const queryParams = {};
    for (const [key, value] of params) {
        queryParams[key] = value;
    }

    return Mock.mock({
        code: 0,
        msg: "用于 E2E 测试",
        data: {
            "total|2000-3000": 0,
            [`rows|${queryParams.limit || 10}`]: [
                {
                    id: "@guid",
                    title: "@ctitle(1,50)",
                    description: "@cparagraph(1,10)",
                    category: {
                        "id|1-10": 0,
                        name: "分类@id",
                    },
                    "scanNumber|0-3000": 0,
                    "commentNumber|0-300": 30,
                    // "thumb|1": ["@image(300x200, @color, #fff, @natural)", null],
                    "thumb|1": ["@image(300x200, @color, #fff, @natural)"],
                    createDate: `@date('T')`,
                }
            ],
        },
    })
})
// console.log("mock")

// 获取博客分类信息
Mock.mock("http://10.1.12.30:5000/get_blogType", "get", {
    code: 0,
    msg: "用于 E2E 测试",
    "data|10-200": [
        {
            "id|+1": 1,
            name: "分类@id",
            'articleCount|10-200': 10, //该分类下文章的数量
            "order|+1": 1,
        },
    ],
})
// console.log("mock")

// 获取单个博客内容
Mock.mock(/^http:\/\/10.1.12.30:5000\/get_blog\/[^/]+$/, "get", {
    code: 0,
    msg: "用于 E2E 测试",
    data:
    {
        "id": "@guid",
        title: "测试-博客标题",
        category:
        {
            "id|1-10": 1,
            name: "分类@id"
        },
        "scanNumber|0-3000": 0,
        "commentNumber|0-300": 30,
        description: "@cparagraph(1,10)",
        createDate: `@date('T')`,
        toc:
            [ // 博客章节目录
                { name: "章节1", anchor: "title-1" },
                {
                    name: "章节2",
                    anchor: "title-2",
                    children: [
                        { name: "章节2-1", anchor: "title-2-1" },
                        { name: "章节2-2", anchor: "title-2-2" },
                    ],
                },
                { name: "章节3", anchor: "title-3" },
            ],
        htmlContent: `<!DOCTYPE html><html lang="zh-CN"><head><meta charset="UTF-8"><title>示例文例文例文章</title></head><body><h1>文章标题</h1><p>这是一段示例文字，这里有一个<h2 id="title-1">锚点title-1</h2>，可以链接到其他页面或本页面的其他位置。
    例文    例文持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。
2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
    例文    例文    例文    </p><p>第二段文字，这里同样有一个<h2 id="title-2">锚点title-2</h2>，用于页面内的导航。持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。
2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。
2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和 </p><p>最后一段内容，这里添加了一个<h2 id="title-2-1">锚点title-2-1</h2>，方便用户快速定位到感兴趣的内容。    持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。
2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。<h2 id="title-2-2">锚点title-2-2</h2>严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。
2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。2024-07-06 18:52:08与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
持不地真为基深听以美。然定打类想记空也近风七能式风代世每。化张水际组计住团东按小导少史备。才说土小化以消建好马满车清做严。口系适利严任海维石约文定。极精比最见列及长后表毛团无铁。2024-07-06 18:52:08沈娟提理相合当半可总劳图究从快。界原级克张近验再局点王装指体联转。该所素类完家理美车口府放见个军。严目格华受科党做几接装各。该日通受三党照消技到展最委。标积技声点看技满长变县府见团全直队。意上位家派明节色作往济近张消名。
2024-07-06 18:52:08万刚见温象值种内使速治头和此从不给。明适效少手长元加连生低太话省被。<h2 id="title-3">锚点title-3</h2>那果很证民听据第改风省知与界就。书交无表事部应活率明等便作八问太。小积断持据共性基亲里如北。农花得金无究验之车每合口石量别级。放验求际元交见走中走始光改其手场装拉。每被律何两农育反空而着书。京张主声少和
    </p></body></html>`,
        thumb: Mock.Random.image("300x200", "#020115", "#fff", "Random Image")
    },
})
// console.log("mock")

// 查询任一篇博客
Mock.mock("http://10.1.12.30:5000/comment", "post", {
    code: 0,
    msg: "用于 E2E 测试",
    data:
    {
        id: "@guid",
        nickname: "1642@cname",
        content: "@cparagraph(1,10)",
        createDate: Date.now(),
    },
})
// console.log("mock")

Mock.mock(/^http:\/\/10.1.12.30:5000\/comment\/?(\?.+)$/, "get", function (options) {
    // 创建一个新的URL对象
    const urlObj = new URL(options.url);
    // 使用URLSearchParams获取查询参数
    const params = new URLSearchParams(urlObj.search);
    // 将查询参数转换为对象
    const queryParams = {};
    for (const [key, value] of params) {
        queryParams[key] = value;
    }

    return Mock.mock({
        code: 0,
        msg: "用于 E2E 测试",
        data: {
            "total|30": 0,
            [`rows|${queryParams.limit || 10}`]: [
                {
                    id: "@guid",
                    nickname: "@cname",
                    content: "@cparagraph(1,10)",
                    createDate: Date.now(),
                },
            ],
        },
    })
})
// console.log("mock")

// 查询任一篇博客
Mock.mock("http://10.1.12.30:5000/setting", "post", {
    code: 0,
    msg: "用于 E2E 测试",
    data:
    {  
        id: "@guid",
        nickname: "1642@cname",
        content: "@cparagraph(1,10)",
        createDate: Date.now(),
    },
})
// console.log("mock")


